---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartRefelementEnd
source: html/1374e4a5-9465-bb37-f7b2-c2a38852decd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartRefelementEnd Property

"Start of Attachment to Reference Element"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartRefelementEnd { get; }
```